### core / bootstrap
brew "fish"
brew "git"
brew "chezmoi"
brew "neovim"
cask "1password"
cask "1password-cli"

### macos usability essentials
cask "karabiner-elements"
cask "linearmouse"

### terminal emulator
cask "ghostty"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"

### shell tools
# nav
brew "yazi"
brew "zoxide"
brew "eza"
# search
brew "fzf"
brew "fd"
brew "rg"
# manipulation
brew "jq"
brew "yq"

### shell styling
# prompt
brew "starship"

### development
# tooling
brew "mise"
brew "uv"
cask "orbstack"

### apps
cask "spotify"
